// 1. Створити змінну з іменем age і присвоїти їй значення свого віку. Вивести значення цієї змінної в консоль.

let age = 14;
console.log(age);

// 2. Створити змінну з іменем name і присвоїти їй значення свого імені. Вивести значення цієї змінної в консоль.

const userName = 'Andrii';
console.log(userName);

// 3. Створити змінну з іменем isStudent і присвоїти їй значення true або false, залежно від того, чи є студентом. Вивести значення цієї змінної в консоль.

let isStudent = true;
console.log(isStudent)

// 4. Створити змінну з іменем myString і присвоїти їй рядок з вашої улюбленою цитатою. Вивести цей рядок в консоль.

let myString = 'Їде venom через venom, бачить venom в річці venom, сунув venom руку в venom, venom venom venom venom';
console.log(myString);

// 5. Створити змінну з іменем myNumber і присвоїти їй довільне числове значення. Потім присвоїти цій змінній результат додавання до неї числа 10. Вивести значення myNumber в консоль.

let myNumber = 74308;
myNumber = myNumber + 10;
console.log(myNumber)

// 6. Створити змінну з іменем myNull і присвоїти їй значення null. Вивести значення цієї змінної в консоль.

let myNull = null;
console.log(myNull)

// 7. Створити скрипт який виводить спливаюче вікно з запитом на введення імені користувача за допомогою prompt(). Після введення імені вивести повідомлення привітання з використанням введеного імені.

function namePrompt() {
    let customName = prompt('Hello what is your name?');
    console.log(customName)
    confirm('Hello ' + customName + ' have a nice day!');
}

// 8. Створити скрипт який виводить спливаюче підтвердження за допомогою confirm(). Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!". Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".

function Confirm() {
    let isConfirm = confirm('Ви впевнені що хочете продовжити?')
    if (isConfirm === true) {
        alert('Дякуємо за підтвердження!');
    }
    else {
        alert('Дію відмінено');
    }
}

// 9. Створити скрипт який виводить спливаюче попередження за допомогою alert(). Вивести повідомлення про те, що дія небезпечна та попросити користувача підтвердити дію за допомогою confirm(). Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!". Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".

function AlertConfirm() {
    alert('Ця дія не безпечна!')
    let isAlertConfirm = confirm('Ви впевнені що хочете продовжити?')
    if (isAlertConfirm === true) {
        alert('Дякуємо за підтвердження!');
    }
    else {
        alert('Дію відмінено');
    }
}